Revit 2026 API

# ExtrusionFailures Properties

---

The BuiltInFailuresExtrusionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotDrawExtrusions | Can't make Extrusion. |
|  | CannotDrawExtrusionsError | Can't make Extrusion. |
|  | ExtrusionTooThin | Extrusion is too thin. |
|  | InvalidExtrusionCurveloop | Base sketch for extrusion is invalid. |
|  | InvalidExtrusionCurveloopError | Base sketch for extrusion is invalid. |

#### Reference

BuiltInFailuresExtrusionFailures Class

Autodesk.Revit.DB Namespace